package HW3;

import java.util.HashMap;
import java.util.Map;
import java.util.Set;

public class Test {
    public static int CheckDataEntered(String data, int trueItemsCount) {
        return data.split(" ").length - trueItemsCount;
    }

    static Map<Character, Set<String>> names;

    static {
        names = new HashMap<>();
        names.put('А', Set.of("Август", "Августин", "Авраам", "Аврора", "Агата", "Агафон",
                "Агнесса", "Агния", "Ада", "Аделаида", "Аделина", "Адонис",
                "Акайо", "Акулина", "Алан", "Алевтина", "Александр",
                "Александра", "Алексей", "Алена", "Алина", "Алиса",
                "Алла", "Алсу", "Альберт", "Альбина", "Альфия", "Альфред",
                "Амалия", "Амелия", "Анастасий", "Анастасия", "Анатолий",
                "Ангелина", "Андрей", "Анжела", "Анжелика", "Анисий", "Анна",
                "Антон", "Антонина", "Анфиса", "Аполлинарий", "Аполлон",
                "Ариадна", "Арина", "Аристарх", "Аркадий", "Арсен", "Арсений",
                "Артем", "Артемий", "Артур", "Архип", "Ася"));
        names.put('Б', Set.of("Беатрис", "Белла", "Бенедикт", "Берта", "Богдан", "Божена",
                "Болеслав", "Борис", "Борислав", "Бронислав", "Бронислава", "Булат"));
        names.put('В', Set.of("Вадим", "Валентин", "Валентина", "Валерий", "Валерия", "Ванда",
                "Варвара", "Василий", "Василиса", "Венера", "Вениамин", "Вера",
                "Вероника", "Викентий", "Виктор", "Виктория", "Вилен", "Виолетта",
                "Виссарион", "Вита", "Виталий", "Влад", "Владимир", "Владислав",
                "Владислава", "Владлен", "Вольдемар", "Всеволод", "Вячеслав"));
        names.put('Г', Set.of("Габриэлла", "Гавриил", "Галина", "Гарри", "Гелла", "Геннадий",
                "Генриетта", "Георгий", "Герман", "Гертруда", "Глафира",
                "Глеб", "Глория", "Гордей", "Грейс", "Грета", "Григорий", "Гульмира"));
        names.put('Д', Set.of("Давид", "Дана", "Даниил", "Даниэла", "Дарина", "Дарья", "Даяна",
                "Демьян", "Денис", "Джеймс", "Джек", "Джессика", "Джозеф", "Диана",
                "Дина", "Динара", "Дмитрий", "Добрыня", "Доминика", "Дора"));
        names.put('Е', Set.of("Ева", "Евгений", "Евгения", "Евдоким", "Евдокия", "Егор",
                "Екатерина", "Елена", "Елизавета", "Елисей", "Есения", "Ефим",
                "Ефрем", "Ефросинья"));
        names.put('Ж', Set.of("Жаклин", "Жанна", "Ждан"));
        names.put('З', Set.of("Захар", "Зинаида", "Зиновий", "Злата", "Зорий", "Зоряна", "Зоя"));
        names.put('И', Set.of("Иван", "Иветта", "Игнатий", "Игорь", "Изабелла", "Изольда",
                "Илга", "Илларион", "Илона", "Илья", "Инга", "Инесса", "Инна",
                "Иннокентий", "Иосиф", "Ираида", "Ираклий", "Ирина", "Итан", "Ия"));
        names.put('К', Set.of("Казимир", "Калерия", "Камилла", "Камиль", "Капитолина", "Карина",
                "Каролина", "Касьян", "Ким,", "Кир", "Кира", "Кирилл", "Клавдия",
                "Клара", "Клариса", "Клим", "Климент", "Кондрат", "Константин",
                "Кристина", "Ксения", "Кузьма"));
        names.put('Л', Set.of("Лада", "Лариса", "Лев", "Леон", "Леонид", "Леонтий", "Леся",
                "Лидия", "Лика", "Лилиана", "Лилия", "Лина", "Лолита", "Луиза",
                "Лукьян", "Любовь", "Людмила"));
        names.put('М', Set.of("Магдалина", "Майя", "Макар", "Максим", "Марат", "Маргарита",
                "Марианна", "Марина", "Мария", "Марк", "Марта", "Мартин",
                "Марфа", "Матвей", "Мелания", "Мелисса", "Милана", "Милена",
                "Мирон", "Мирослава", "Мирра", "Митрофан", "Михаил", "Мия",
                "Модест", "Моисей", "Мухаммед"));
        names.put('Н', Set.of("Надежда", "Назар", "Наоми", "Наталия", "Наталья", "Наум",
                "Нелли", "Ника", "Никанор", "Никита", "Никифор", "Николай",
                "Николь", "Никон", "Нина", "Нинель", "Нонна", "Нора"));
        names.put('О', Set.of("Оксана", "Олег", "Олеся", "Оливер", "Оливия", "Ольга", "Оскар"));
        names.put('П', Set.of("Павел", "Парамон", "Патрик", "Паула", "Петр", "Платон",
                "Полина", "Прасковья", "Прохор"));
        names.put('Р', Set.of("Рада", "Радмила", "Раиса", "Райан", "Раймонд", "Раяна", "Регина",
                "Ренат", "Рената", "Рику", "Римма", "Ринат", "Рита", "Роберт",
                "Родион", "Роза", "Роксана", "Роман", "Россияна", "Ростислав",
                "Руслан", "Рустам", "Рэн"));
        names.put('С', Set.of("Сабина", "Савва", "Савелий", "Саки", "Сакура", "Самсон", "Самуил",
                "Сарра", "Светлана", "Святослав", "Севастьян", "Семен", "Серафима",
                "Сергей", "Сильвия", "Снежана", "Сора", "София", "Софья", "Станислав",
                "Стелла", "Степан", "Стефания"));
        names.put('Т', Set.of("Таисия", "Такеши", "Тамара", "Тамила", "Тарас", "Татьяна", "Теодор",
                "Тереза", "Терентий", "Тимофей", "Тимур", "Тина", "Тихон", "Томас", "Трофим"));
        names.put('У', Set.of("Ульяна", "Урсула"));
        names.put('Ф', Set.of("Фаддей", "Фаина", "Федор", "Федот", "Феликс", "Филат", "Филимон",
                "Филипп", "Фома", "Фрида"));
        names.put('Х', Set.of("Хина", "Хлоя"));
        names.put('Ч', Set.of("Чарли"));
        names.put('Ш', Set.of("Шарлотта", "Шейла", "Шелли"));
        names.put('Э', Set.of("Эдгар", "Эдита", "Эдуард", "Элеонора", "Элина", "Элла", "Эльвира",
                "Эльдар", "Эльза", "Эмили", "Эмилия", "Эмма", "Эрик", "Эрика"));
        names.put('Ю', Set.of("Юи", "Юлиан", "Юлиана", "Юлий", "Юлия", "Юма", "Юна", "Юрий"));
    }

    public static boolean IsName(String token) {
        char firstLetter = token.charAt(0);
        if (names.containsKey(firstLetter))
            return names.get(firstLetter).contains(token);
        return false;
    }
}